Project/Toir/src/DataProcessors/торо_ОбщийПланРабот/торо_ОбщийПланРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ОбщийПланРабот</name>
  <tabularSections>
    <name>ВидыРемонтов</name>
    <attributes>
      <name>ВидСкользящегоПлана</name>
      <type>
        <types>CatalogRef.торо_ВидыСкользящихПланов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗаявкиПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УточнениеИсполнителя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеЗаявки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеМероприятия/торо_ПлановыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ДетализацияПлана/торо_ДетализацияПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ДетализацияПлана</name>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ПланРаботПодразделения/торо_ПланРаботПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПланРаботПодразделения</name>
  <registerRecords>InformationRegister.торо_СкользящийПланРегламентныхМероприятий</registerRecords>
  <registerRecords>InformationRegister.торо_СкользящийПланРабот</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПлана</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <type>
      <types>CatalogRef.торо_ВидыСкользящихПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтсчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьПланирования</name>
    <type>
      <types>EnumRef.торо_ДетализацияПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРемонтовПлана</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
        <types>DocumentRef.торо_ОстановочныеРемонты</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаЗавершения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонтаИсходная</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтаИсходная</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаЗавершенияИсходная</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Регламентный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокВидовРемонта</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/DataProcessors/торо_ОбщийПланРабот/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_МакетПланаРемонтовНаПериод") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_МакетПланаРемонтовНаПериод", 
		НСтр("es='El plan general de los trabajos';ru='Общий план работ';en='General plan of work'"), 
		СформироватьПечатнуюФормуПланРабот(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
КонецПроцедуры

// Процедуры формирования команд и макетов печатной формы ПФ_MXL_МакетПланаРемонтовНаПериод.
Функция СформироватьПечатнуюФормуПланРабот(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОбщийПланРабот";
	УстановитьПривилегированныйРежим(Истина);
	ТабличныйДокумент = ПечатьПланРабот(МассивОбъектов, ПараметрыПечати);
	УстановитьПривилегированныйРежим(Ложь);
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура вывода на экран печатной формы документа
// торо_ПланГрафикРемонта.
//  
Функция ПечатьПланРабот(ПланРабот, ПараметрыПечати)
	
    ВыводитьПо        = ПараметрыПечати.ГруппироватьПо;
    ИнтервалРазбиения = ПараметрыПечати.ИнтервалРазбиения;
	ПериодНач         = ПараметрыПечати.ДатаНачала;
	ПериодКон         = ПараметрыПечати.ДатаОкончания;
	Организация       = ПараметрыПечати.Организация;
	ВидПлана          = ПараметрыПечати.ВидПлана;
	
	ОтборПечатнойФормы = ПараметрыПечати.ОтборФормы;
	Если ОтборПечатнойФормы[0].Имя = "Объект ремонта" Тогда
		ОтборПечатнойФормы[0].Имя = "ОбъектыРемонта";
		ОтборПечатнойФормы[1].Имя = "ВидыРемонта";
		НомерСтрокиОР = 0;
		НомерСтрокиВР = 1;
	Иначе
		ОтборПечатнойФормы[0].Имя = "ВидыРемонта";
		ОтборПечатнойФормы[1].Имя = "ОбъектыРемонта";
		НомерСтрокиОР = 1;
		НомерСтрокиВР = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПланРабот) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ОбъектРемонта КАК ОбъектРемонтныхРабот,
		               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ВидРемонта КАК ВидРемонтныхРабот,
		               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаНачала КАК ДатаНач,
		               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаОкончания КАК ДатаКон,
		               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения
		               |ИЗ
		               |	Документ.торо_ПланРаботПодразделения.СписокРемонтовПлана КАК торо_ПланРаботПодразделенияСписокРемонтовПлана
		               |ГДЕ
		               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.Ссылка = &Ссылка
					   |	И (НЕ &ИспользоватьОтборПоОР ИЛИ торо_ПланРаботПодразделенияСписокРемонтовПлана.ОбъектРемонта В (&ОбъектыРемонта))
					   |	И (НЕ &ИспользоватьОтборПоВР ИЛИ торо_ПланРаботПодразделенияСписокРемонтовПлана.ВидРемонта В (&ВидыРемонта))";

		Запрос.УстановитьПараметр("Ссылка", ПланРабот);	
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                |	торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор КАК Регистратор,
		                |	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта,
		                |	ВЫБОР
		                |		КОГДА торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель = НЕОПРЕДЕЛЕНО
		                |			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		                |		ИНАЧЕ торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель
		                |	КОНЕЦ КАК Исполнитель,
		                |	ВЫБОР
		                |		КОГДА торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя = НЕОПРЕДЕЛЕНО
		                |			ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка)
		                |		ИНАЧЕ торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя
		                |	КОНЕЦ КАК УточнениеИсполнителя,
		                |	торо_ЗаявкиПоРемонтамСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		                |	торо_ЗаявкиПоРемонтамСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот
		                |ПОМЕСТИТЬ ВТ_Заявки
		                |ИЗ
		                |	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
		                |		ПО торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта = торо_ОтмененныеЗаявки.ИДРемонта
		                |			И торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор = торо_ОтмененныеЗаявки.Заявка
		                |ГДЕ
		                |	НЕ торо_ЗаявкиПоРемонтамСрезПоследних.Отменен
		                | 	И торо_ОтмененныеЗаявки.НомерСтроки ЕСТЬ NULL
		                |
		                |ИНДЕКСИРОВАТЬ ПО
		                |	IDРемонта
		                |;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНач,
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаКон,
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот.Подразделение КАК Подразделение,
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
						|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
						|	""ППР"" КАК ИсточникДанных
						|ПОМЕСТИТЬ ВТ_ППР
						|ИЗ
						|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
						|								,
						|								(НЕ &ИспользоватьОтборПоОР ИЛИ ОбъектРемонтныхРабот В (&ОбъектыРемонта))
					   	|								И (НЕ &ИспользоватьОтборПоВР ИЛИ ВидРемонтныхРабот В (&ВидыРемонта))) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
						|ГДЕ
						|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
						|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
						|	И торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот МЕЖДУ &ДатаНачала И &ДатаОкончания
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
						|	ВТ_ППР.ID КАК ID,
						|	ВТ_ППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
						|	ЕСТЬNULL(ВТ_Заявки.ДатаНачалаРемонтныхРабот, ВТ_ППР.ДатаНач) КАК ДатаНач,
		               	|	ЕСТЬNULL(ВТ_Заявки.ДатаОкончанияРемонтныхРабот, ВТ_ППР.ДатаКон) КАК ДатаКон,
						|	ВТ_ППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
						|	ВТ_ППР.ОбъектРемонтныхРабот.Подразделение КАК Подразделение,
						|	ВТ_ППР.Регистратор КАК ДокументППР,
						|	""ППР"" КАК ИсточникДанных
						|ПОМЕСТИТЬ ТаблицаНачало
		                |ИЗ
		                |	ВТ_ППР КАК ВТ_ППР
		                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
		                |		ПО ВТ_ППР.ID = ВТ_Заявки.IDРемонта
						|
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|	торо_ПлановыеРемонтныеРаботы.ID,
						|	торо_ПлановыеРемонтныеРаботы.ВидМероприятия,
						|	торо_ПлановыеРемонтныеРаботы.ДатаНачала,
						|	торо_ПлановыеРемонтныеРаботы.ДатаОкончания,
						|	торо_ПлановыеРемонтныеРаботы.СписокОбъектов,
						|	торо_ПлановыеРемонтныеРаботы.СписокОбъектов.ПодразделениеИсполнитель,
						|	торо_ПлановыеРемонтныеРаботы.Регистратор,
						|	""РМ""
						|ИЗ
						|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(
						|								,
						|								(НЕ &ИспользоватьОтборПоОР ИЛИ СписокОбъектов В (&ОбъектыРемонта))
					   	|								И (НЕ &ИспользоватьОтборПоВР ИЛИ ВидМероприятия В (&ВидыРемонта))) КАК торо_ПлановыеРемонтныеРаботы
						|ГДЕ
						|	НЕ торо_ПлановыеРемонтныеРаботы.Отменен
						|	И торо_ПлановыеРемонтныеРаботы.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
						|
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|	РемонтыВД.ID,
						|	РемонтЗаявка.ВидРемонта,
						|	РемонтЗаявка.ДатаНачалаПлан,
						|	РемонтЗаявка.ДатаОкончанияПлан,
						|	РемонтЗаявка.ОбъектРемонта,
						|	РемонтЗаявка.ОбъектРемонта.Подразделение,
						|	РемонтЗаявка.Регистратор,
						|	""СПД""
						|ИЗ
						|	РегистрСведений.торо_Ремонты КАК РемонтыВД
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК РемонтЗаявка
						|		ПО РемонтыВД.ID = РемонтЗаявка.ID
						|			И (РемонтЗаявка.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
						|			И (РемонтыВД.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты)
						|ГДЕ
						|	НЕ РемонтЗаявка.ДатаНачалаПлан ЕСТЬ NULL
						|	И РемонтЗаявка.ДатаНачалаПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
						|	И (НЕ &ИспользоватьОтборПоОР ИЛИ РемонтЗаявка.ОбъектРемонта В (&ОбъектыРемонта))
					   	|	И (НЕ &ИспользоватьОтборПоВР ИЛИ РемонтЗаявка.ВидРемонта В (&ВидыРемонта))
						|
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|	РемонтыВД.ID,
						|	РемонтЗаявка.ВидРемонта,
						|	РемонтЗаявка.ДатаНачалаПлан,
						|	РемонтЗаявка.ДатаОкончанияПлан,
						|	РемонтЗаявка.ОбъектРемонта,
						|	РемонтЗаявка.ОбъектРемонта.Подразделение,
						|	РемонтЗаявка.Регистратор,
						|	""СПВН""
						|ИЗ
						|	РегистрСведений.торо_Ремонты КАК РемонтыВД
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК РемонтЗаявка
						|		ПО РемонтыВД.ID = РемонтЗаявка.ID
						|			И (РемонтЗаявка.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
						|			И (РемонтыВД.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот)
						|ГДЕ
						|	НЕ РемонтЗаявка.ДатаНачалаПлан ЕСТЬ NULL
						|	И РемонтЗаявка.ДатаНачалаПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
						|	И (НЕ &ИспользоватьОтборПоОР ИЛИ РемонтЗаявка.ОбъектРемонта В (&ОбъектыРемонта))
					   	|	И (НЕ &ИспользоватьОтборПоВР ИЛИ РемонтЗаявка.ВидРемонта В (&ВидыРемонта))
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ТаблицаНачало.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
						|	ТаблицаНачало.ДатаНач КАК ДатаНач,
						|	ТаблицаНачало.ДатаКон КАК ДатаКон,
						|	ТаблицаНачало.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот
						|ИЗ
						|	ТаблицаНачало КАК ТаблицаНачало";
						
		Запрос.УстановитьПараметр("ДатаНачала",    ПериодНач);
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодКон);

	КонецЕсли;
	
	СтрокаОтбора = ОтборПечатнойФормы[НомерСтрокиОР];
	Если СтрокаОтбора.Использование Тогда
		ВидСравненияВЗапросе = ПолучитьВидСравненияДляЗапроса(СтрокаОтбора.ВидСравнения);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРемонта В (&ОбъектыРемонта)", "ОбъектРемонта " + ВидСравненияВЗапросе.ВидСравненияНачало + " &ОбъектыРемонта" + ВидСравненияВЗапросе.ВидСравненияКонец);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СписокОбъектов В (&ОбъектыРемонта)", "СписокОбъектов " + ВидСравненияВЗапросе.ВидСравненияНачало + " &ОбъектыРемонта" + ВидСравненияВЗапросе.ВидСравненияКонец);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРемонтныхРабот В (&ОбъектыРемонта)", "ОбъектРемонтныхРабот " + ВидСравненияВЗапросе.ВидСравненияНачало + " &ОбъектыРемонта" + ВидСравненияВЗапросе.ВидСравненияКонец);
		Запрос.УстановитьПараметр("ИспользоватьОтборПоОР", Истина);
		Если СтрокаОтбора.ВидСравнения = ВидСравнения.Содержит Или СтрокаОтбора.ВидСравнения = ВидСравнения.НеСодержит Тогда
			Запрос.УстановитьПараметр("ОбъектыРемонта", "%" + СтрокаОтбора.Значение + "%");
		Иначе
			Запрос.УстановитьПараметр("ОбъектыРемонта", СтрокаОтбора.Значение);
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("ИспользоватьОтборПоОР", Ложь);
		Запрос.УстановитьПараметр("ОбъектыРемонта", СтрокаОтбора.Значение);
	КонецЕсли;
	
	СтрокаОтбора = ОтборПечатнойФормы[НомерСтрокиВР];
	Если СтрокаОтбора.Использование Тогда
		ВидСравненияВЗапросе = ПолучитьВидСравненияДляЗапроса(СтрокаОтбора.ВидСравнения);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидРемонта В (&ВидыРемонта)", "ВидРемонта " + ВидСравненияВЗапросе.ВидСравненияНачало + " &ВидыРемонта" + ВидСравненияВЗапросе.ВидСравненияКонец);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидМероприятия В (&ВидыРемонта)", "ВидМероприятия " + ВидСравненияВЗапросе.ВидСравненияНачало + " &ВидыРемонта" + ВидСравненияВЗапросе.ВидСравненияКонец);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидРемонтныхРабот В (&ВидыРемонта)", "ВидРемонтныхРабот " + ВидСравненияВЗапросе.ВидСравненияНачало + " &ВидыРемонта" + ВидСравненияВЗапросе.ВидСравненияКонец);
		Запрос.УстановитьПараметр("ИспользоватьОтборПоВР", Истина);
		Если СтрокаОтбора.ВидСравнения = ВидСравнения.Содержит Или СтрокаОтбора.ВидСравнения = ВидСравнения.НеСодержит Тогда
			Запрос.УстановитьПараметр("ВидыРемонта", "%" + СтрокаОтбора.Значение + "%");
		Иначе
			Запрос.УстановитьПараметр("ВидыРемонта", СтрокаОтбора.Значение);
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("ИспользоватьОтборПоВР", Ложь);
		Запрос.УстановитьПараметр("ВидыРемонта", СтрокаОтбора.Значение);
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ДатаНач";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПланРемонтов = РезультатЗапроса.Выгрузить();
	
	Наименование = "";
	ТаблицаПлана = Новый ТабличныйДокумент;
	
	ТаблицаПлана.Очистить();
	
	МакетТаблицы =  УправлениеПечатью.МакетПечатнойФормы("Обработка.торо_ОбщийПланРабот.ПФ_MXL_МакетПланаРемонтовНаПериод");
	
	Область = МакетТаблицы.ПолучитьОбласть("Заголовок");	
	Область.Параметры.НачалоПериода = Формат(ПериодНач, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
	Область.Параметры.КонецПериода  = Формат(ПериодКон, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения"""); 	
	Область.Параметры.Организация   = Организация;
	Область.Параметры.ВидПлана      = ВидПлана;
	
	
	ТаблицаПлана.Вывести(Область);

	ПериодовВОтчете = (НачалоДня(ПериодКон) - НачалоДня(ПериодНач))/(60*60*24);
	
	Область = МакетТаблицы.ПолучитьОбласть("Шапка");
	
	ШиринаТаблицы = Область.ШиринаТаблицы;
	
	ТаблицаПлана.Вывести(Область);
	
	ТемпДата = НачалоДня(ПериодНач);
	
	ПериодНачРасчетный = ПериодНач;
	ПериодКонРасчетный = ПериодКон;
	
	МассивВременныхИнтервалов = Новый Массив;
	
	Если ИнтервалРазбиения = Перечисления.торо_ДетализацияПлана.День Тогда
		ПериодКонРасчетный = КонецДня(ПериодКон);
		ПериодовВОтчете = 0;
		СледующийДень = Истина;
		Пока СледующийДень Цикл
			Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
			ОбластьОформления = Область.Область("Знач");
			
			Область.Параметры.НомИнтервала = Формат(ТемпДата, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
			Если ДеньНедели(Дата(Год(ТемпДата), Месяц(ТемпДата), День(ТемпДата), 0,0,0))=6 Или ДеньНедели(Дата(Год(ТемпДата), Месяц(ТемпДата), День(ТемпДата), 0,0,0))=7 Тогда
				ОбластьОформления.ЦветФона = Новый Цвет(255,251,240);
				ОбластьОформления.ЦветТекста = Новый Цвет(0,0,0);
			КонецЕсли;
			
			ЕдиничныйИнтервал = Новый Структура;
			ЕдиничныйИнтервал.Вставить("НачИнт",НачалоДня(ТемпДата));
			ЕдиничныйИнтервал.Вставить("КонИнт",КонецДня(ТемпДата));	
			МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);
			
			ТаблицаПлана.Присоединить(Область);
			ТемпДата = ТемпДата+60*60*24; 
			Если ТемпДата > ПериодКонРасчетный Тогда
				СледующийДень = Ложь;		
			КонецЕсли;
			ПериодовВОтчете = ПериодовВОтчете + 1;
		КонецЦикла;
		ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
		
	ИначеЕсли ИнтервалРазбиения = Перечисления.торо_ДетализацияПлана.Неделя Тогда 
		ПериодКонРасчетный = КонецНедели(ПериодКон);
		ТемпДата = НачалоДня(НачалоНедели(ПериодНач));
		ПериодовВОтчете = 0;	
		СледующаяНеделя = Истина;
		Пока СледующаяНеделя Цикл 
			Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
			ОбластьОформления = Область.Область("Знач");
			
			Область.Параметры.НомИнтервала = Формат(ТемпДата, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""") + "-" + Формат(ТемпДата+60*60*24*6, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
			ТаблицаПлана.Присоединить(Область);
			
			ЕдиничныйИнтервал = Новый Структура;
			ЕдиничныйИнтервал.Вставить("НачИнт",НачалоНедели(ТемпДата));
			ЕдиничныйИнтервал.Вставить("КонИнт",КонецНедели(ТемпДата));	
			МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

			ТемпДата = ТемпДата+60*60*24*7;
			Если НачалоДня(ТемпДата) > НачалоДня(ПериодКонРасчетный) Тогда
				СледующаяНеделя = Ложь;		
			КонецЕсли;	
			ПериодовВОтчете = ПериодовВОтчете + 1;
		КонецЦикла;
		ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
		
    ИначеЕсли ИнтервалРазбиения = Перечисления.торо_ДетализацияПлана.Месяц Тогда 
		ПериодКонРасчетный = КонецМесяца(ПериодКон);
		ТемпДата = НачалоМесяца(ПериодНач);
		ПериодовВОтчете = 0;
		СледующийМесяц = Истина;
		Пока СледующийМесяц Цикл
			Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
			ОбластьОформления = Область.Область("Знач");
			
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			Область.Параметры.НомИнтервала = НазваниеМесяцаСтрокой_ИменительныйПадеж(ТемпДата) + Символы.ПС + Сред(ТемпДата,7,4); 
			//Область.Параметры.НомИнтервала = НазваниеМесяцаСтрокойПадежное(Месяц(ТемпДата)) + Символы.ПС + Сред(ТемпДата,7,4); 
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТаблицаПлана.Присоединить(Область);
			
			ЕдиничныйИнтервал = Новый Структура;
			ЕдиничныйИнтервал.Вставить("НачИнт",НачалоМесяца(ТемпДата));
			ЕдиничныйИнтервал.Вставить("КонИнт",КонецМесяца(ТемпДата));	
			МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

			ТемпДата = ДобавитьМесяц(ТемпДата,1);
			Если ТемпДата > ПериодКонРасчетный Тогда
				СледующийМесяц = Ложь;		
			КонецЕсли;	
			ПериодовВОтчете = ПериодовВОтчете + 1;
		КонецЦикла;
		ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
		
	ИначеЕсли ИнтервалРазбиения = Перечисления.торо_ДетализацияПлана.Год Тогда 
		ПериодКонРасчетный = КонецГода(ПериодКон);
		ТемпДата = НачалоГода(ПериодНач);
		ПериодовВОтчете = 0;
		СледующийГод = Истина;
		Пока СледующийГод Цикл
			Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
			ОбластьОформления = Область.Область("Знач");
			
			Область.Параметры.НомИнтервала = Сред(ТемпДата,7,4); 
			ТаблицаПлана.Присоединить(Область);
			
			ЕдиничныйИнтервал = Новый Структура;
			ЕдиничныйИнтервал.Вставить("НачИнт",НачалоГода(ТемпДата));
			ЕдиничныйИнтервал.Вставить("КонИнт",КонецГода(ТемпДата));	
			МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);
			
			ТемпДата = ДобавитьМесяц(ТемпДата,12);
			Если ТемпДата > ПериодКонРасчетный Тогда
				СледующийГод = Ложь;		
			КонецЕсли;	
			ПериодовВОтчете = ПериодовВОтчете + 1;
		КонецЦикла; 
		ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
		
	ИначеЕсли ИнтервалРазбиения = Перечисления.торо_ДетализацияПлана.Час Тогда 
		ПериодКонРасчетный = ПериодКон;
		ТемпДата = ПериодНач;
		ПериодовВОтчете = 0;
		СледующийЧас = Истина;
		
		ДатаДня = НачалоДня(ТемпДата);
		НомерКолонки = 6;
		НомерСтроки  = 13;
		
		Пока СледующийЧас Цикл
			Область = МакетТаблицы.ПолучитьОбласть("СтолбецЧасы");
			ОбластьОформления = Область.Область("ЗначЧас");
			
			Область.Параметры.Дата         = Формат(ТемпДата, "ДФ='dd MMMM'");
			Область.Параметры.НомИнтервала = Формат(ТемпДата, "ДФ='HH"":00""'");
 
			ТаблицаПлана.Присоединить(Область);
			
			ЕдиничныйИнтервал = Новый Структура;
			ЕдиничныйИнтервал.Вставить("НачИнт",ТемпДата);
			ЕдиничныйИнтервал.Вставить("КонИнт",ТемпДата + 3599);	
			МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

			ТемпДата = ТемпДата + 3600;
			
			Если НЕ ДатаДня = НачалоДня(ТемпДата) Тогда //Нужно объединить ячейки с датами
				ТаблицаПлана.Область(НомерСтроки, НомерКолонки, НомерСтроки + 1, НомерКолонки + 23).Объединить();
				НомерКолонки = НомерКолонки + 24;
				ДатаДня = НачалоДня(ТемпДата);
			КонецЕсли; 
			
			Если ТемпДата > ПериодКонРасчетный Тогда
				СледующийЧас = Ложь;		
			КонецЕсли;	
			ПериодовВОтчете = ПериодовВОтчете + 1;
		КонецЦикла;
		ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
	
	КонецЕсли;
	
	// Непосредственно вывод данных по объекту
	
	НСТР = 1;
	
	СписокХранения = Новый СписокЗначений;
	
	Для каждого СтрокаТаблицы Из ПланРемонтов Цикл
		
		Если ВыводитьПо = "Объектам ремонта" Тогда
			ОбъектДляДобавления =  СтрокаТаблицы.ОбъектРемонтныхРабот;
		Иначе
			ОбъектДляДобавления =  СтрокаТаблицы.ВидРемонтныхРабот;	
		КонецЕсли;
			
			
		Если СписокХранения.НайтиПоЗначению(ОбъектДляДобавления) = Неопределено Тогда
			СписокХранения.Добавить(ОбъектДляДобавления);			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивОбъектов = СписокХранения.ВыгрузитьЗначения();
	КоличествоОбъектов = МассивОбъектов.Количество();	
	Для каждого ОбъектДляОтчета Из МассивОбъектов Цикл
		Область = МакетТаблицы.ПолучитьОбласть("СтрокаЗаполнения");
		ФорматнаяОбласть = Область.Область("НаимПрим");
		Если ВыводитьПо = "Объектам ремонта" И ТипЗнч(ОбъектДляОтчета) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
			ФорматнаяОбласть.Примечание.Текст = ОбъектДляОтчета.ПлановыйГрафикРаботы.Наименование;
		КонецЕсли;
		Область.Параметры.НПП = НСТР;
		
		Если ВыводитьПо = "Объектам ремонта" Тогда 
			Область.Параметры.НаименовОбъекта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектДляОтчета);			
		Иначе
			Область.Параметры.НаименовОбъекта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ОбъектДляОтчета);
		КонецЕсли;
		
		ТаблицаПлана.Вывести(Область);	
		
		ЛинияСплошная = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ЛинияНикакая = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		Условие = Новый Структура;
		
		
		Если ВыводитьПо = "Объектам ремонта" Тогда 
			Условие.Вставить("ОбъектРемонтныхРабот", ОбъектДляОтчета);			
		Иначе
			Условие.Вставить("ВидРемонтныхРабот", ОбъектДляОтчета);	
			МассивОбъектовРемонта = Новый Массив;
		КонецЕсли;
		
		НайденныеСтроки = ПланРемонтов.НайтиСтроки(Условие); 		
		Для Сч = 1 По  МассивВременныхИнтервалов.Количество() Цикл
			
			БуфГод = "";
			ТекущийПериодНач = МассивВременныхИнтервалов[Сч-1].НачИнт;
			ТекущийПериодКон = МассивВременныхИнтервалов[Сч-1].КонИнт;
			
			Если ИнтервалРазбиения = Перечисления.торо_ДетализацияПлана.Час Тогда
				Область = МакетТаблицы.ПолучитьОбласть("ЗначенияДняЧас");
			Иначе
				Область = МакетТаблицы.ПолучитьОбласть("ЗначенияДня");
			КонецЕсли; 

			ОбластьФормат =  Область.Область();
			Если ВыводитьПо = "Видам работ" Тогда
				МассивОбъектовРемонта.Очистить();
			КонецЕсли;
			Для Каждого ОбъектСравнения Из НайденныеСтроки Цикл 
				
					Если ОбъектСравнения.ДатаКон<ОбъектСравнения.ДатаНач Тогда
						КонечнаяДата = КонецДня(ОбъектСравнения.ДатаНач);	
					Иначе
						КонечнаяДата = ОбъектСравнения.ДатаКон;
					КонецЕсли; 
				
					Если ((ТекущийПериодКон>=ОбъектСравнения.ДатаНач) И (ТекущийПериодНач<=КонечнаяДата))
						Или ((ТекущийПериодКон>ОбъектСравнения.ДатаНач) И (ТекущийПериодНач<=КонечнаяДата)) Тогда
						ОбластьФормат.ЦветФона = Новый Цвет(255, 251, 240);
						ОбластьФормат.ГраницаСлева = ЛинияНикакая;
						ОбластьФормат.ГраницаСправа = ЛинияСплошная;
						
						Если ВыводитьПо = "Объектам ремонта" Тогда						
							ПредставлениеВидаРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ОбъектСравнения.ВидРемонтныхРабот);
							БуфГод = БуфГод + ПредставлениеВидаРемонта + ", ";
							ОбластьФормат.Примечание.Текст = ОбластьФормат.Примечание.Текст + ПредставлениеВидаРемонта 
															 + " (" + Лев(ОбъектСравнения.ДатаНач, 10) + " - " + Лев(ОбъектСравнения.ДатаКон, 10) + ") " + Символы.ПС;
						Иначе
							ПредставлениеОР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектСравнения.ОбъектРемонтныхРабот);
							Если МассивОбъектовРемонта.Найти(ОбъектСравнения.ОбъектРемонтныхРабот) = Неопределено Тогда
								БуфГод = БуфГод + СокрЛП(ПредставлениеОР);
								БуфГод = БуфГод + ", ";
								МассивОбъектовРемонта.Добавить(ОбъектСравнения.ОбъектРемонтныхРабот);
							КонецЕсли;
							ОбластьФормат.Примечание.Текст = ОбластьФормат.Примечание.Текст + ПредставлениеОР 
															 + " (" + Лев(ОбъектСравнения.ДатаНач, 10) + " - " + Лев(ОбъектСравнения.ДатаКон, 10) + ") " + Символы.ПС;
						КонецЕсли;
													
					КонецЕсли;	
				
			КонецЦикла;	
			Область.Параметры.заполнение = Лев(БуфГод,СтрДлина(БуфГод)-2);
			ТаблицаПлана.Присоединить(Область);
					
		КонецЦикла;				
		НСТР = НСТР + 1;
		
	КонецЦикла;	
	Область = МакетТаблицы.ПолучитьОбласть("Пояснение");	
	ТаблицаПлана.Вывести(Область);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "торо_ПечатьПланаРабот_ПФ_MXL_МакетПланаРемонтовНаПериод";
	ТабДок.ИмяПараметровПечати = "торо_ПечатьПланаРабот_ПФ_MXL_МакетПланаРемонтовНаПериод";
	ТабДок.ВставитьОбласть(ТаблицаПлана.Область());
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
	Возврат ТабДок;
	
КонецФункции

// Формирование названия месяца с учетом падежа (именительный и родительный).
//
// Параметры:
// 	НомерМесяца - номер месяца в году.
//		Падеж - указание падежа, в котором нужно сформировать название месяца
//				("Имен" - именительный, по-умолчанию; "Род" - родительный).
//
// Возвращаемое значение:
// 		Строка, название месяца с учетом падежа.
//
Функция НазваниеМесяцаСтрокойПадежное(Знач НомерМесяца, Знач Падеж="Имен")
    Если Падеж="Род" Тогда
     Если НомерМесяца=1 Тогда
    	Возврат "января";
     ИначеЕсли НомерМесяца=2 Тогда
    	Возврат "февраля";
     ИначеЕсли НомерМесяца=3 Тогда
    	Возврат "марта";
     ИначеЕсли НомерМесяца=4 Тогда
    	Возврат "апреля";
     ИначеЕсли НомерМесяца=5 Тогда
    	Возврат "мая";
     ИначеЕсли НомерМесяца=6 Тогда
    	Возврат "июня";
     ИначеЕсли НомерМесяца=7 Тогда
    	Возврат "июля";
     ИначеЕсли НомерМесяца=8 Тогда
    	Возврат "августа";
     ИначеЕсли НомерМесяца=9 Тогда
    	Возврат "сентября";
     ИначеЕсли НомерМесяца=10 Тогда
    	Возврат "октября";
     ИначеЕсли НомерМесяца=11 Тогда
    	Возврат "ноября";
      ИначеЕсли НомерМесяца=12 Тогда
    	Возврат "декабря";
      КонецЕсли;
   КонецЕсли;
   Если Падеж="Имен" Тогда
     Если НомерМесяца=1 Тогда
    	Возврат "январь";
     ИначеЕсли НомерМесяца=2 Тогда
    	Возврат "февраль";
     ИначеЕсли НомерМесяца=3 Тогда
    	Возврат "март";
     ИначеЕсли НомерМесяца=4 Тогда
    	Возврат "апрель";
     ИначеЕсли НомерМесяца=5 Тогда
    	Возврат "май";
     ИначеЕсли НомерМесяца=6 Тогда
    	Возврат "июнь";
     ИначеЕсли НомерМесяца=7 Тогда
    	Возврат "июль";
     ИначеЕсли НомерМесяца=8 Тогда
    	Возврат "август";
     ИначеЕсли НомерМесяца=9 Тогда
    	Возврат "сентябрь";
     ИначеЕсли НомерМесяца=10 Тогда
    	Возврат "октябрь";
     ИначеЕсли НомерМесяца=11 Тогда
    	Возврат "ноябрь";
      ИначеЕсли НомерМесяца=12 Тогда
    	Возврат "декабрь";	
      КонецЕсли;
   КонецЕсли;
   
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [26.09.2019]
Функция НазваниеМесяцаСтрокой_ИменительныйПадеж(Знач Дата)
	НазваниеМесяца = Формат(Дата, "ДФ=MMMM");
	Возврат НазваниеМесяца;
КонецФункции
// << [Деснол] [Ушаков А.Д.] [26.09.2019] 

Функция ПолучитьВидСравненияДляЗапроса(ВидСравненияОтбора) 
	
	СтруктураВидаСравнения = Новый Структура;
	СтруктураВидаСравнения.Вставить("ВидСравненияНачало");
	СтруктураВидаСравнения.Вставить("ВидСравненияКонец");
	Если ВидСравненияОтбора = ВидСравнения.НеРавно Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = "<>";
		СтруктураВидаСравнения.ВидСравненияКонец = "";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.ВСписке Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = "В(";
		СтруктураВидаСравнения.ВидСравненияКонец = ")";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.НеВСписке Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = "НЕ В(";
		СтруктураВидаСравнения.ВидСравненияКонец = ")";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.ВСпискеПоИерархии Или ВидСравненияОтбора = ВидСравнения.ВИерархии Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = "В ИЕРАРХИИ(";
		СтруктураВидаСравнения.ВидСравненияКонец = ")";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.НеВИерархии Или ВидСравненияОтбора = ВидСравнения.НеВСпискеПоИерархии Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = "НЕ В ИЕРАРХИИ(";
		СтруктураВидаСравнения.ВидСравненияКонец = ")";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.Больше Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = ">";
		СтруктураВидаСравнения.ВидСравненияКонец = "";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.БольшеИлиРавно Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = ">=";
		СтруктураВидаСравнения.ВидСравненияКонец = "";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.Меньше Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = "<";
		СтруктураВидаСравнения.ВидСравненияКонец = "";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.МеньшеИлиРавно Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = "<=";
		СтруктураВидаСравнения.ВидСравненияКонец = "";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.Содержит Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = " ПОДОБНО ВЫРАЗИТЬ(";
		СтруктураВидаСравнения.ВидСравненияКонец = " КАК Строка(900))";
		Возврат СтруктураВидаСравнения;
	ИначеЕсли ВидСравненияОтбора = ВидСравнения.НеСодержит Тогда
		СтруктураВидаСравнения.ВидСравненияНачало = " НЕ ПОДОБНО ВЫРАЗИТЬ(";
		СтруктураВидаСравнения.ВидСравненияКонец = " КАК Строка(900))";
		Возврат СтруктураВидаСравнения;
	Иначе 
		СтруктураВидаСравнения.ВидСравненияНачало = "=";
		СтруктураВидаСравнения.ВидСравненияКонец = "";
		Возврат СтруктураВидаСравнения;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
